config.org
#+title: doom-emacs config
#+startup: overview
#+PROPERTY: header-args:elisp :noeval

* General
** User Information
:PROPERTIES:
:ID:       47537e03-28e5-4adf-ac0b-ab8249ce01bf
:END:

Some functionality uses this to identify you, e.g. GPG configuration, email
clients, file templates and snippets.

#+BEGIN_SRC elisp
(setq user-full-name "Stefan Lendl"
      user-mail-address "ste.lendl@gmail.com")
#+END_SRC

** literate config
*** Don't auto-recompile literate-config
:PROPERTIES:
:ID:       7f52c1ee-6fff-4e04-96fa-8c5a2bf3ad14
:END:

#+BEGIN_SRC elisp
(remove-hook 'org-mode-hook #'+literate-enable-recompile-h)
#+END_SRC

*** private config file
:PROPERTIES:
:ID:       b1cd6206-b586-45d7-8b1f-e03823bde124
:END:

~doom/goto-private-config-file~ goes to ~config.el~ which I will never edit by hand.
Opening ~config.org~ makes much more sense.

#+begin_src elisp
(defun stfl/goto-private-config-file ()
  "Open your private config.el file."
  (interactive)
  (find-file (expand-file-name "config.org" doom-private-dir)))
#+end_src

bind it to ~SPC h d c~

#+begin_src elisp
(define-key! help-map
      "dc" #'stfl/goto-private-config-file
      "dC" #'doom/open-private-config)
#+end_src

** Buffer Settings
:PROPERTIES:
:ID:       508b2ffc-2dfd-49e1-b44e-af2994a59df0
:END:

#+BEGIN_SRC elisp
;; (global-auto-revert-mode 1)
(setq undo-limit 80000000
      evil-want-fine-undo t
      inhibit-compacting-font-caches t)
#+END_SRC

*** Auto-saving all buffers

#+BEGIN_SRC elisp
(setq auto-save-default t)
(run-with-idle-timer 60 t '(lambda () (save-some-buffers t)))
#+END_SRC

** Open External Browser

Use Brave browser if availible. The default should actually respect the $BROWSER env

#+begin_src elisp
(when (executable-find "brave")
  (setq! browse-url-browser-function 'browse-url-chromium
         browse-url-chromium-program "brave"))
#+end_src

** Resizing window with the mouse

Resizing a window vertically with the mouse in emacs requires you to hit the 1px
thick line between windows.
This is less of a problem horizontally, because you can drag the modeline.

To make this easier use, ~Meta + left mouse drag~ to activate the resizing.
This only works if there is a window to the right. Window is resized, after
passing the border with the mouse.

#+begin_src elisp
(global-set-key [M-drag-mouse-2] #'mouse-drag-vertical-line)
#+end_src

It would be nice to do that on the left fringe!
But this would active again resizing to the right...

#+begin_src elisp
;; (defun mouse-drag-left-line (start-event)
;;   "Change the width of a window by dragging on a vertical line.
;; START-EVENT is the starting mouse event of the drag action."
;;   (interactive "e")
;;   (mouse-drag-line start-event 'left))

;; (global-set-key [left-fringe drag-mouse-1] #'mouse-drag-left-line)
#+end_src

** Motions
:PROPERTIES:
:ID:       1ff57529-42f3-4cb9-b974-70c0f0315b36
:END:

limit evil-snipe to the bufffer
#+BEGIN_SRC elisp
(after! evil-snipe
  (setq evil-snipe-scope 'visible
        evil-snipe-repeat-scope 'visible))
#+END_SRC

#+begin_src elisp
(map! :leader "f ." #'find-file-at-point)
#+end_src

Always indent the line when pressing tab regardles of the cursor position.
If the line is already correctly indented, try to complete.

#+begin_src elisp
(setq! tab-always-indent 'complete)
#+end_src

#+begin_src elisp
(after! evil-escape
  (setq evil-escape-key-sequence "jk"))
#+end_src

** moving lines up and down 

#+begin_src elisp :tangle packages.el
(package! drag-stuff)
#+end_src

#+begin_src elisp
(use-package! drag-stuff
   :commands (drag-stuff-up drag-stuff-down drag-stuff-lef drag-stuff-right)
   :config
   (map! "<M-up>"    #'drag-stuff-up
         "<M-down>"  #'drag-stuff-down
         "<M-left>"  #'drag-stuff-left
         "<M-right>" #'drag-stuff-right))
#+end_src

** Garbage Collection

Disable automatic garbage collection and run when emacs is idle.

https://jackjamison.xyz/blog/emacs-garbage-collection/

#+begin_src elisp
;; (defun my-minibuffer-setup-hook ()
;;   (setq gc-cons-threshold most-positive-fixnum))

;; (defun my-minibuffer-exit-hook ()
;;   (setq gc-cons-threshold 800000000))

;; (add-hook 'minibuffer-setup-hook #'my-minibuffer-setup-hook)
;; (add-hook 'minibuffer-exit-hook #'my-minibuffer-exit-hook)

(setq gc-cons-threshold most-positive-fixnum)

(run-with-idle-timer 1.2 t 'garbage-collect)
#+end_src

* Theme
** doom-theme
:PROPERTIES:
:ID:       d7635d76-1c4b-49de-a68d-be6dd0467919
:END:

#+BEGIN_SRC elisp
(setq doom-theme 'doom-one)
#+END_SRC

#+BEGIN_SRC elisp
(setq! display-line-numbers-type t)
(setq! which-key-idle-delay 0.3)
#+END_SRC

** Font
:PROPERTIES:
:ID:       edf590c3-3d81-45b2-a180-fb46609bc099
:END:

Doom exposes five (optional) variables for controlling fonts in Doom. Here
are the three important ones:

+ `doom-font'
+ `doom-variable-pitch-font'
+ `doom-big-font' -- used for `doom-big-font-mode'; use this for
  presentations or streaming.

They all accept either a font-spec, font string ("Input Mono-12"), or xlfd
font string. You generally only need these two:

#+BEGIN_SRC elisp
(let ((font "JetBrains Mono Nerd Font Mono"))
  (setq doom-font (font-spec :family font :size 13)
        doom-variable-pitch-font (font-spec :family font)
        doom-big-font (font-spec :family font :size 20)))
#+END_SRC

font detection taken from tecosaur https://tecosaur.github.io/emacs-config/config.html#font-face

#+begin_src elisp :tangle no
(defvar required-fonts
  '("JetBrainsMono.*"
    ;; "Overpass"
    ;; "JuliaMono"
    ;; "IBM Plex Mono"
    ;; "Merriweather"
    ;; "Alegreya"
    ))

(defvar available-fonts
  (delete-dups (or (font-family-list)
                   (split-string (shell-command-to-string "fc-list : family")
                                 "[,\n]"))))

(defvar missing-fonts
  (delq nil (mapcar
             (lambda (font)
               (unless (delq nil (mapcar (lambda (f)
                                           (string-match-p (format "^%s$" font) f))
                                         available-fonts))
                 font))
             required-fonts)))

(if missing-fonts
    (pp-to-string
     `(unless noninteractive
        (add-hook! 'doom-init-ui-hook
          (run-at-time nil nil
                       (lambda ()
                         (message "%s missing the following fonts: %s"
                                  (propertize "Warning!" 'face '(bold warning))
                                  (mapconcat (lambda (font)
                                               (propertize font 'face 'font-lock-variable-name-face))
                                             ',missing-fonts
                                             ", "))
                         (sleep-for 0.5))))))
  ";; No missing fonts detected")
#+end_src

** Faces
:PROPERTIES:
:ID:       a0baba11-f7c0-484f-b9e3-e75957447031
:END:

#+begin_src elisp
(custom-set-faces!
  `(whitespace-indentation :background ,(doom-color 'base4)) ; Visually highlight if an indentation issue was discovered which emacs already does for us
  `(magit-branch-current  :foreground ,(doom-color 'blue) :box t)
  '(lsp-inlay-hint-face :height 0.85 :italic t :inherit font-lock-comment-face)
  `(+org-todo-cancel :foreground ,(doom-blend (doom-color 'red) (doom-color 'base5) 0.35) :inherit (bold org-done))
  `(+org-todo-idea   :foreground ,(doom-darken (doom-color 'green) 0.4) :inherit (bold org-todo))
)
#+end_src

** adoc-mode theme


#+begin_src elisp
(custom-set-faces!
  '(adoc-code-face :inherit org-block)
  '(adoc-complex-replacement-face :inherit org-code :weight 'bold)
  '(adoc-meta-face :inherit org-meta-line)
  '(adoc-typewriter-face :inherit org-code)
  '(adoc-verbatim-face :inherit org-verbatim)
  '(adoc-internal-reference-face :inherit org-link)
  '(adoc-reference-face :inherit org-link)
  `(adoc-emphasis-face :foreground ,(doom-lighten (doom-color 'green) 0.2) :slant italic)
  '(adoc-bold-face :weight 'bold)
  `(adoc-command-face :foreground ,(doom-color 'base1) :background ,(doom-color 'base6))
  '(adoc-warning-face :inherit org-warning))
#+end_src

** notmuch theme

#+begin_src elisp
(custom-set-faces!
 '(notmuch-message-summary-face      :foreground "#848d94")  ;; between dooms base6 and base7
 `(notmuch-wash-cited-text           :foreground ,(doom-color 'base6))
 `(notmuch-search-subject            :foreground ,(doom-darken (doom-color 'fg) 0.05))
 '(notmuch-search-unread-face        :weight bold :slant italic)
 `(notmuch-tree-match-tree-face      :foreground              ,(doom-color 'yellow))
 `(notmuch-tree-no-match-tree-face   :foreground              ,(doom-color 'base5))
 `(notmuch-tree-no-match-author-face :foreground ,(doom-darken (doom-color 'blue)    0.3))
 `(notmuch-tree-no-match-date-face   :foreground ,(doom-darken (doom-color 'numbers) 0.3))
 `(notmuch-tree-no-match-tag-face    :foreground ,(doom-darken (doom-color 'yellow)  0.4)))
#+end_src

There is more fine grained face control for search based on tags :

** popup rules
:PROPERTIES:
:ID:       1f322103-dc44-4293-b354-a8f5301b89e4
:END:

#+BEGIN_SRC elisp
;; (set-popup-rules!
;;   '(("^\\*subject:" :ignore t)  ; notmuch list view
;;     ("^CAPTURE" :side 'bottom :size 0.40 :select t :ttl nil)
;;     ("^\\*Org Note" :side 'bottom :size 0.40 :select t :ttl nil)
;;     ("^\\*Org QL View" :side 'left :size 0.40 :select t :quit nil)))
#+END_SRC

  # (set-popup-rule! "*ChatGPT*" :side 'bottom :size 30 :select t :quit nil))

#+begin_src elisp
(set-popup-rule! "^\\*ein:" :ignore t :quit nil)
#+end_src

  # ;; (set-popup-rule! "^\\*Minimap" :modeline nil)

** blamer theme

#+begin_src elisp
(custom-set-faces!
  `(blamer-face :italic t :height 90 :weight semi-light :foreground ,(doom-color 'base5)))

(custom-set-faces!
  `(blamer-face :inherit font-lock-comment-face
    :italic t
    :font "JetBrains Mono"
    :height 0.9
    :background unspecified
    ;; :weight semi-light
    ;; :foreground ,(doom-color 'base5)
    ))
#+end_src

** Minimap (demap.el)

#+begin_src elisp :tangle packages.el
(package! demap :recipe (:host gitlab :repo "sawyerjgardner/demap.el"))
;; (package! demap)
#+end_src

#+begin_src elisp
;; (after! (solaire-mode demap)
(use-package! demap
  :commands demap-toggle
  :config
  (setq demap-minimap-window-width 15)
  (let ((gray1 "#1A1C22")
        (gray2 "#21242b")
        (gray3 "#282c34")
        (gray4 "#2b3038") )
    (face-spec-set 'demap-minimap-font-face
                   `((t :background ,gray2
                        :inherit    unspecified
                        :family     "minimap"
                        :height     10          )))
    (face-spec-set 'demap-visible-region-face
                   `((t :background ,gray4
                        :inherit    unspecified )))
    (face-spec-set 'demap-visible-region-inactive-face
                   `((t :background ,gray3
                        :inherit    unspecified )))
    (face-spec-set 'demap-current-line-face
                   `((t :background ,gray1
                        :inherit    unspecified )))
    (face-spec-set 'demap-current-line-inactive-face
                   `((t :background ,gray1
                        :inherit    unspecified ))))

;;   (defun my-track-window-update-p()
;;     "my minimap update predicate function.

;; minimaps only show windows in the same frame"
;;     (and (demap-track-w-mode-update-p-func-default)
;;          (get-buffer-window) ))

;;   (setq demap-track-window-mode-update-p-func #'my-track-window-update-p)

  (map!
   :leader
   :prefix ("t" "+toggle")
   :desc "Minimap" "m" #'demap-toggle)
  )
#+end_src

** Indent Guides

Make the indent guides a little brighter to be more visible in doom-one dark theme.

#+begin_src elisp
(after! highlight-indent-guides
  (setq! highlight-indent-guides-auto-character-face-perc 20))
#+end_src

** tab-width

#+begin_src elisp
(setq! tab-width 4)
#+end_src

* [#D] Org mode settings
** General
:PROPERTIES:
:ID:       90a92aaa-d50a-4524-9a97-bad904b60939
:END:

Org directory

#+BEGIN_SRC elisp
(setq org-directory "~/.org")
#+END_SRC


# Add a when condition that only adjust settings when certain features are enabled... This depends on where i'm running Emacs from (eg: Terminla, X11 or native).
# #+BEGIN_SRC elisp
# (when (require 'org-superstar nil 'noerror)
#   (setq org-superstar-headline-bullets-list '("◉" "●" "○")
#         org-superstar-item-bullet-alist nil))
# #+END_SRC

always generate an id for a link

#+BEGIN_SRC elisp
(after! org-id
  (setq org-id-link-to-org-use-id t
        org-id-locations-file (doom-path doom-local-dir "org-id-locations")
        org-id-track-globally t))
#+END_SRC

rebuild orgid file on start at the first time emacs is idle for 20 sec

#+begin_src elisp
(after! org-id (run-with-idle-timer 20 nil 'org-id-update-id-locations))
#+end_src

also rebuild that via org-roam

#+begin_src elisp
(after! org-roam (run-with-idle-timer 25 nil 'org-roam-update-org-id-locations))
#+end_src

** Appearance

First I like to add some extra fancy stuff to make org-mode more appealing when i'm using =+pretty= flag.

- Other options for ellipsis "▼, ↴, ⬎, ⤷,…, and ⋱."
- Extra options for headline-bullets-list: "◉" "●" "○" "∴"

#+BEGIN_SRC elisp
(after! org
  (setq! org-auto-align-tags nil
         org-tags-column 0
         org-fold-catch-invisible-edits 'show-and-error
         org-ellipsis "…"
         org-indent-indentation-per-level 2)
  
  (auto-fill-mode))
#+END_SRC


#+begin_src elisp
; (custom-declare-face 'org-checkbox-statistics-todo '((t (:inherit (bold font-lock-constant-face org-todo)))) "")

(custom-set-faces!
  ;; '(org-date :foreground "dark goldenrod" :height 0.85)
  '(org-document-title :foreground "#c678dd" :weight bold :height 1.8)
  ;; '(org-drawer :foreground "dark gray" :height 0.8)
  ;; '(org-property-value :height 0.85)
  '(org-ql-view-due-date :foreground "dark goldenrod")
  ;; '(org-special-keyword :foreground "#83898d" :height 0.8)
  ;; '(org-tag :foreground "#83898d" :weight light :height 0.7)
  `(org-code :foreground ,(doom-lighten (doom-color 'warning) 0.3) :extend t)
  '(outline-1 :height 1.5)
  '(outline-2 :height 1.25)
  '(outline-3 :height 1.15))
#+end_src

To enhance the appearance of org-mode, doomemacs uses [[https://github.com/minad/org-modern][org-modern]].

~Keywords~

#+begin_src elisp
#+end_src

To make the ~priorities~ mor visually appealing we add some nice symbols.

#+begin_src elisp
(after! org-modern
  (setq! org-modern-priority
         '((?A . "⛔")
           (?B . "𐱄")
           (?C . "▲")
           (?D . "ᐱ")
           (?E . "Ⲷ")
           (?F . "ᐯ")
           (?G . "▼")
           (?H . "𐠠")
           (?I . "҉"))
         org-priority-faces
         '((?A :foreground "red3" :weight bold :height .95)
           (?B :foreground "OrangeRed2" :weight bold)
           (?C :foreground "DarkOrange2" :weight bold)
           (?D :foreground "gold3" :weight bold)
           (?E :foreground "OliveDrab1" :weight bold)
           (?F :foreground "SpringGreen3" :weight bold)
           (?G :foreground "cyan4" :weight bold)
           (?H :foreground "DeepSkyBlue4" :weight bold)
           (?I :foreground "LightSteelBlue3" :weight bold)
           )
         ))
#+end_src
 

** Auto-saving org-mode files

Automatically saving all org-buffers when emacs is idle for 30 seconds.

#+BEGIN_SRC elisp
(after! org (run-with-idle-timer 60 t #'org-save-all-org-buffers))
#+END_SRC

** Completion backends in org-mode

This is simply copied from discord.. Probably not that bad but don't know.. I
wanted to disable completion of enflish words.  These propbably come from
completion-at-point (capf)...

#+begin_src elisp
(after! org
  (set-company-backend! 'org-mode
    '(:separate company-capf
      :separate company-org-roam
      :separate company-yasnippet
      :separate company-files)))
#+end_src

