packages.el
(package! demap :recipe (:host gitlab :repo "sawyerjgardner/demap.el"))
;; (package! demap)
