config.org
** Logging and Drawers
:PROPERTIES:
:ID:       28e25bba-6724-4710-b3b9-570cc8da948c
:END:

For the logging drawers, we like to keep our notes and clock history *seperate* from our properties drawer...
#+BEGIN_SRC elisp
(after! org (setq org-log-state-notes-insert-after-drawers nil))
#+END_SRC

Next, we like to keep a history of our activity of a task so we *track* when changes occur, and we also keep our notes logged in *their own drawer*. Optionally you can also add the following in-buffer settings to override the =org-log-into-drawer= function. ~#+STARTUP: logdrawer~ or ~#+STARTUP: nologdrawer~
#+BEGIN_SRC elisp
(after! org
  (setq org-log-into-drawer t
        org-log-done 'time+note
        org-log-repeat 'time
        org-log-redeadline 'time
        org-log-reschedule 'time
        ))
#+END_SRC

** Properties
:PROPERTIES:
:ID:       6ed1956f-d162-4dd0-a755-8d684cebc681
:END:

#+BEGIN_SRC elisp
(after! org
  (setq org-use-property-inheritance t ; We like to inherit properties from their parents
        org-catch-invisible-edits 'error ; Catch invisible edits
        org-track-ordered-property-with-tag t
        org-hierarchical-todo-statistics nil
        ))
#+END_SRC

** Default Tags
:PROPERTIES:
:ID:       37ad2d09-7250-443e-9bbd-26c3b4305b72
:END:

REVIEW should we define any additional tags?
#+BEGIN_SRC elisp
(after! org
  (setq org-tag-alist '((:startgrouptag)
                        ("Context" . nil)
                        (:grouptags)
                        ("@home" . ?h)
                        ("@office". ?o)
                        ("@sarah" . ?s)
                        ("@kg" . ?k)
                        ("@jg" . ?j)
                        ;; ("@robert" . ?r)
                        ;; ("@baudock_meeting" . ?b)
                        ;; ("@PC" . ?p)
                        ;; ("@phone" . ?f)
                        (:endgrouptag)
                        (:startgrouptag)
                        ("Process" . nil)
                        (:grouptags)
                        ("SOMEDAY" . ?S)
                        ;; ("REFILE" . ?R)
                        ("HABIT" . ?H)
                        ("LASTMILE" . ?L)
                        ("DRAG" . ?D)
                        (:endgrouptag)
                        (:startgrouptag)
                        ("Areas" . nil)
                        (:grouptags)
                        ("#work" . ?$)
                        ("#personal" . ?_)
                        ("emacs" . ?-)
                        )))
#+END_SRC

** Tag colors

#+begin_src elisp
(after! org
  (setq! org-tag-faces `(("LASTMILE" . (:foreground ,(doom-color 'red) :strike-through t))
                         ("HABIT" . (:foreground ,(doom-darken (doom-color 'orange) 0.2)))
                         ("SOMEDAY" . (:slant 'italic :weight 'bold))
                         ;; ("finance" . (:foreground "goldenrod"))
                         ;; ("#inbox" . (:background ,(doom-color 'base4) :foregorund ,(doom-color 'base8)))
                         ("#inbox" . (:strike-through t))
                         ("3datax" . (:foreground ,(doom-color 'green)))
                         ("oebb" . (:foreground ,(doom-color 'green)))
                         ("pulswerk" . (:foreground ,(doom-color 'dark-blue)))
                         ("#work" . (:foreground ,(doom-color 'blue)))
                         ;; ("#work" . (:foreground ,(doom-color 'blue)))
                         ("@ikea" . (:foreground ,(doom-color 'yellow)))
                         ("@amazon" . (:foreground ,(doom-color 'yellow)))
                         ;; ("emacs" . (:foreground "#c678dd"))
                         ))
  )
#+end_src

** org-roam
:PROPERTIES:
:ID:       812f2cef-61c0-4299-907d-a601e577f59d
:END:

Roam directory setup
#+BEGIN_SRC elisp
(after! org-roam
  (setq org-roam-tag-sources '(prop last-directory)
        org-roam-directory org-directory
        org-roam-db-location (doom-path doom-local-dir "roam.db")
        org-roam-file-exclude-regexp "\.org/\(?jira\\|\.stversions\)/"))
#+END_SRC

do not automatically open the roam side-pane

#+begin_src elisp
(after! org-roam
  (setq +org-roam-open-buffer-on-find-file nil))
#+end_src

#+begin_src elisp
(after! org-roam
  (setq org-roam-dailies-capture-templates
        '(("d" "default"
           entry "* %?\n:PROPERTIES:\n:ID: %(org-id-new)\n:END:\n\n"
           :target (file+head "%<%Y-%m-%d>.org" "#+title: %<%Y-%m-%d>\n")))))
#+end_src

  # ;; (setq org-roam-capture-templates
  # ;;       '(("f" "fleeting" plain (function org-roam-capture--get-point)
  # ;;          "%?"
  # ;;          :file-name "roam/fleeting/${slug}"
  # ;;          :head "#+title: ${title}\n#+roam_tags: %^{tags}\n\n"
  # ;;          :unnarrowed t)
  # ;;         ("p" "private" plain (function org-roam-capture--get-point)
  # ;;          "%?"
  # ;;          :file-name "roam/private/${slug}"
  # ;;          :head "#+title: ${title}\n"
  # ;;          :unnarrowed t)
  # ;;         ("c" "coding" plain (function org-roam-capture--get-point)
  # ;;          "%?"
  # ;;          :file-name "roam/coding/${slug}"
  # ;;          :head "#+title: ${title}\n#+roam_tags: %^{tags}\n\n"
  # ;;          :unnarrowed t)
  # ;;         ))
  # )

** org-roam-ui
:PROPERTIES:
:ID:       3eda31cf-7dda-43be-b65c-a8b3599b4b72
:END:


#+begin_src elisp :tangle packages.el
(package! websocket)
(package! org-roam-ui
  :recipe (:host github
           :repo "org-roam/org-roam-ui"
           :files ("*.el" "out")))
#+end_src

#+begin_src elisp
(use-package! websocket
    :after org-roam)

(use-package! org-roam-ui
    :after org-roam ;; or :after org
;;         normally we'd recommend hooking orui after org-roam, but since org-roam does not have
;;         a hookable mode anymore, you're advised to pick something yourself
;;         if you don't care about startup time, use
;;  :hook (after-init . org-roam-ui-mode)
    :config
    (setq org-roam-ui-sync-theme t
          org-roam-ui-follow t
          org-roam-ui-update-on-save t
          org-roam-ui-open-on-start t))
#+end_src

** org-gcal
:PROPERTIES:
:ID:       f1d8ded8-e6be-461e-a593-160f6b275574
:END:

#+BEGIN_SRC elisp
(after! org-gcal
;; (use-package! org-gcal
  (setq org-gcal-client-id (get-auth-info "org-gcal-client-id" "ste.lendl@gmail.com")
        org-gcal-client-secret (get-auth-info "org-gcal-client-secret" "ste.lendl@gmail.com")
        org-gcal-fetch-file-alist
        `(("ste.lendl@gmail.com" . ,(doom-path org-directory "gcal/stefan.org"))
          ("vthesca8el8rcgto9dodd7k66c@group.calendar.google.com" . ,(doom-path org-directory "gcal/oskar.org")))
        org-gcal-token-file "~/.config/authinfo/org-gcal-token.gpg"
        org-gcal-down-days 180
        ;; org-gcal-auto-archive nil ;; workaround for "rx "**" range error" https://github.com/kidd/org-gcal.el/issues/17
        ))

#+END_SRC

#+begin_src elisp
(map!
 :after (org org-gcal)
 :map org-mode-map
 :leader
 (:prefix ("n" . "notes")
  (:prefix ("j" . "sync")
   :desc "sync Google Calendar" "g" #'org-gcal-sync)))

(map!
 :after (org org-gcal)
 :map org-mode-map
 :localleader
 :prefix ("C" . "Google Calendar")
   :desc "sync Google Calendar" "g" #'org-gcal-sync
   "S" #'org-gcal-sync-buffer
   "p" #'org-gcal-post-at-point
   "d" #'org-gcal-delete-at-point
   "f" #'org-gcal-fetch
   "F" #'org-gcal-fetch-buffer)
#+end_src

** Drawing Diagrams with Mermaid
:PROPERTIES:
:ID:       819cb74f-3d27-4a76-bb81-06b9d1b714b5
:END:

Org babel to generate mermaid diagrams from org src blocks


#+begin_src elisp :tangle packages.el
(package! ob-mermaid
  :disable t)
#+end_src

#+begin_src elisp
(use-package! ob-mermaid
  :after org
  :init
  (setq ob-mermaid-cli-path "/home/stefan/.yarn/bin/mmdc")
  :config
  (add-to-list 'org-babel-load-languages '(mermaid . t)))
#+end_src

** org-jira

:PROPERTIES:
:ID:       9e6bc5aa-89b0-43f0-aad1-2c8212e0bae7
:END:

#+begin_src elisp :tangle packages.el
(package! org-jira
  :disable t)
#+end_src

#+BEGIN_SRC elisp
(use-package! org-jira
  :after org
  :init (setq org-jira-working-dir (doom-path org-directory "jira/")
              jiralib-url "https://pulswerk.atlassian.net")
  ;; (defconst org-jira-progress-issue-flow
  ;;     '(("To Do" . "In Progress"
  ;;     ("In Progress" . "Done"))))
  :config
  (setq org-jira-jira-status-to-org-keyword-alist '(("To Do" . "TODO")
                                                    ("Planned" . "NEXT")
                                                    ("In Progress" . "NEXT")
                                                    ("Staging" . "DONE")
                                                    ("Ready" . "DONE")
                                                    ("Done" . "DONE")
                                                    ("Released" . "DONE"))
        org-jira-priority-to-org-priority-alist (list (cons "Highest" ?A)
                                                      (cons "High" ?C)
                                                      ;; (cons "Medium" ?E)  ;; no org priority for /default/
                                                      (cons "Low" ?E)
                                                      (cons "Lowest" ?F))

        org-jira-custom-jqls '((:jql "
assignee='Stefan Lendl'
AND (Sprint in openSprints()
     OR (Project = MD
         AND status != Done))
ORDER BY priority, created DESC
"
           :limit 300
           :filename "active")))

  (map!
   :map org-mode-map
   :localleader
   :prefix ("j" . "Jira")
   :desc "Get issues from JQL" "j" #'org-jira-get-issues-from-custom-jql
   "n" #'org-jira-create-issue
   "t" #'org-jira-progress-issue
   "T" #'org-jira-progress-issue-next
   "a" #'org-jira-assign-issue
   "r" #'org-jira-refresh-issue
   "b" #'org-jira-refresh-issues-in-buffer
   "u" #'org-jira-update-issue
   "S" #'org-jira-create-subtask
   "s" #'org-jira-get-subtasks
   "N" #'org-jira-todo-to-jira
   (:prefix ("w" . "Worklogs")
    "c" #'org-jira-update-worklogs-from-org-clocks
    "u" #'org-jira-update-worklogs
    "i" #'org-jira-update-worklogs-for-issue)
   (:prefix ("c" . "Comments")
    :desc "Add Comment" "c" #'org-jira-add-comment
    :desc "Update Comment" "u" #'org-jira-update-comment))

  (map!
   :map org-jira-map
   :leader
   (:prefix ("n" . "notes")
    (:prefix ("j" . "sync")
     :desc "Get issues from JQL" "j" #'org-jira-get-issues-from-custom-jql))))
#+END_SRC

** org-babel
*** Auto :async if possible
:PROPERTIES:
:ID:       d41d54d8-bf68-42be-8004-f67c49cf950a
:END:

https://tecosaur.github.io/emacs-config/config.html#babel

#+begin_src elisp
(add-transient-hook! #'org-babel-execute-src-block
  (require 'ob-async))

(defvar org-babel-auto-async-languages '()
  "Babel languages which should be executed asyncronously by default.")

(defadvice! org-babel-get-src-block-info-eager-async-a (orig-fn &optional light datum)
  "Eagarly add an :async parameter to the src information, unless it seems problematic.
This only acts o languages in `org-babel-auto-async-languages'.
Not added when either:
+ session is not \"none\"
+ :sync is set"
  :around #'org-babel-get-src-block-info
  (let ((result (funcall orig-fn light datum)))
    (when (and (string= "none" (cdr (assoc :session (caddr result))))
               (member (car result) org-babel-auto-async-languages)
               (not (assoc :async (caddr result))) ; don't duplicate
               (not (assoc :sync (caddr result))))
      (push '(:async) (caddr result)))
    result))
#+end_src

*** Individual startup visibility with :hidden

https://emacs.stackexchange.com/a/44923/30180

#+BEGIN_SRC elisp
(after! org
  (defun individual-visibility-source-blocks ()
    "Fold some blocks in the current buffer with property :hidden"
    (interactive)
    (org-show-block-all)
    (org-block-map
     (lambda ()
       (let ((case-fold-search t))
         (when (and
                (save-excursion
                  (beginning-of-line 1)
                  (looking-at org-block-regexp))
                (cl-assoc
                 ':hidden
                 (cl-third
                  (org-babel-get-src-block-info))))
           (org-hide-block-toggle))))))

  (add-hook 'org-mode-hook #'individual-visibility-source-blocks))
#+END_SRC

** Org Emphasis
:PROPERTIES:
:ID:       c8b37906-ad3a-4891-9234-6c8627fb4d61
:END:

Allow emphasis like *bold* or /italic/ also inside a *Wo/*rd/
#+begin_src elisp
;; (after! org
;;   (setcar org-emphasis-regexp-components "-[:space:]('\"{[:alpha:]")                     ; post
;;   (setcar (nthcdr 1 org-emphasis-regexp-components) "[:alpha:]-[:space:].,:!?;'\")}\\[") ; pre
;;   (org-set-emph-re 'org-emphasis-regexp-components org-emphasis-regexp-components)
;;   )
#+end_src

** Org Pandoc Import

https://github.com/tecosaur/org-pandoc-import

#+begin_src elisp :tangle packages.el
;; (package! org-pandoc-import
;;   :recipe (:host github
;;            :repo "tecosaur/org-pandoc-import"
;;            :files ("*.el" "filters" "preprocessors")))
#+end_src

#+begin_src elisp
;; (use-package! org-pandoc-import :after org)
#+end_src

** Org Tree Slide (+present)

Don't emphasize the heading -> it's way too big

#+begin_src elisp
(after! org-tree-slide (setq org-tree-slide-heading-emphasis nil))
#+end_src

disable line numbers in presentations.

#+begin_src elisp
(after! org-tree-slide
  (add-hook 'org-tree-slide-play-hook #'doom-disable-line-numbers-h)
  (add-hook 'org-tree-slide-stop-hook #'doom-disable-line-numbers-h))
#+end_src

Starting org-tree-slide fails with an error.
https://github.com/doomemacs/doomemacs/issues/7058

#+begin_src elisp
(after! org-tree-slide
  (remove-hook 'org-tree-slide-play-hook #'+org-present-hide-blocks-h)
  (remove-hook 'org-tree-slide-stop-hook #'+org-present-hide-blocks-h))
#+end_src

