config.org
** auth-sources and passwords

function to load a secret from an auth-source. [[https://gist.github.com/letoh/5497116][letoh/creation-prompt.el]]

#+BEGIN_SRC elisp
(defun get-auth-info (host user &optional port)
  (let ((info (nth 0 (auth-source-search
                      :host host
                      :user user
                      :port port
                      :require '(:user :secret)))))
    (if info
        (let ((secret (plist-get info :secret)))
          (if (functionp secret)
              (funcall secret)
            secret))
      nil)))
#+END_SRC

get-password

#+begin_src elisp
(defun get-password (&rest keys)
  (let ((result (apply #'auth-source-search keys)))
    (when result
      (funcall (plist-get (car result) :secret)))))
#+end_src

#+begin_src elisp
;; (setq! auth-sources 'password-store)
#+end_src

** Define Word
:PROPERTIES:
:ID:       8ce8fe9c-bf84-469c-afcd-3e9fc5ecc167
:END:

#+BEGIN_SRC elisp
;; (use-package! define-word
;;   :after org
;;   :config
;;   (map! :after org
;;         :map org-mode-map
;;         :leader
;;         :desc "Define word at point" "@" #'define-word-at-point))
#+END_SRC

** Pandoc
:PROPERTIES:
:ID:       535b2018-8890-4e62-a293-a92df0734c07
:END:

#+BEGIN_SRC elisp
(setq org-pandoc-options '((standalone . t) (self-contained . t)))
#+END_SRC

** ansi colors in plaintext files
:PROPERTIES:
:ID:       2e1dec14-e6d4-4a74-9643-b8ce695ecec8
:END:

https://tecosaur.github.io/emacs-config/config.html#plaintext

#+begin_src elisp
(after! text-mode
  (add-hook! 'text-mode-hook
             ;; Apply ANSI color codes
             (with-silent-modifications
               (ansi-color-apply-on-region (point-min) (point-max)))))
#+end_src

** vterm
:PROPERTIES:
:ID:       ac7ce678-a39e-4e3e-8911-c5155e79a620
:END:


#+begin_src elisp :tangle packages.el
(package! vterm :disable t)
#+end_src

#+begin_src elisp
(after! vterm
  (setq! vterm-max-scrollback 200000
         ;; vterm-min-window-width 5000
         )) ;; do not wrap long lines per default
#+end_src

Allow to insert C-x. otherwise it's not possible to leave nano if exidently opened in vterm.

Send some keys directly to vterm to trigger zsh functions!

#+begin_src elisp
(map!
 :after vterm
 :map vterm-mode-map
 "C-c C-x" #'vterm--self-insert
 :n "C-r" #'vterm--self-insert
 :n "C-j" #'vterm--self-insert
 :i "C-j" #'vterm--self-insert
 :i "TAB" #'vterm-send-tab
 :i "<tab>" #'vterm-send-tab)
#+end_src


For some reason, emacs-vterm tries to send C-j as return to the terminal instead of C-m.
This breaks my zsh config, so I am forcing it to send C-m.

Send C-j directly as configured above which then triggers history-substring-search-down

#+begin_src elisp
(after! vterm
  (defun vterm-send-return ()
    "Send `C-m' to the libvterm."
    (interactive)
    (deactivate-mark)
    (when vterm--term
      (process-send-string vterm--process "\C-m"))))
#+end_src

use bash when opening a vterm in a tramp dir:

#+begin_src elisp
(after! vterm
  (setq! vterm-tramp-shells '(("docker" "/bin/sh")
                              ("ssh" "/bin/bash"))))
#+end_src

** Typst

#+begin_src elisp :tangle packages.el
(package! typst-ts-mode
  :recipe (:type git :host codeberg
           :repo "meow_king/typst-ts-mode"
           :files (:defaults "*.el")))
#+end_src

#+begin_src emacs-lisp
(use-package! typst-ts-mode
  :init
  (setq! typst-ts-watch-options "--open"
         typst-ts-mode-grammar-location (expand-file-name "tree-sitter/libtree-sitter-typst.so" user-emacs-directory)
         typst-ts-mode-enable-raw-blocks-highlight t)
  :config
  (setq! typst-ts-mode-indent-offset 2)
  (map! :map typst-ts-mode-map
        "C-c C-c" #'typst-ts-tmenu
        :localleader
        :desc "Compile" "c" #'typst-ts-compile
        :desc "Watch" "w" #'typst-ts-watch-mode
        :desc "Menu" "m" #'typst-ts-tmenu)
  (add-hook! 'typst-ts-mode-hook #'lsp-deferred))
#+end_src

#+begin_src emacs-lisp
(after! lsp-mode
  (add-to-list 'lsp-language-id-configuration '(typst-ts-mode . "typst") t)

  (lsp-register-client
   (make-lsp-client :new-connection (lsp-stdio-connection "tinymist")
                    :activation-fn (lsp-activate-on "typst")
                    :server-id 'tinymist)))
#+end_src

#+begin_src emacs-lisp
(after! org
  (add-to-list 'org-src-lang-modes '("typst" . typst-ts))
  
  ;; Set up babel support for Typst
  (org-babel-do-load-languages
   'org-babel-load-languages
   '((typst . t)))

  ;; Configure babel execution for Typst
  (defun org-babel-execute:typst (body params)
    "Execute a block of Typst code with org-babel."
    (message "Executing Typst code block")
    (let* ((in-file (org-babel-temp-file "typst-" ".typ"))
           (out-file (or (cdr (assq :file params))
                         (org-babel-temp-file "typst-" ".pdf")))
           (result-params (cdr (assq :result-params params)))
           (cmdline (or (cdr (assq :cmdline params)) "")))
      (with-temp-file in-file
        (insert body))
      (org-babel-eval
       (format "typst compile %s %s %s" cmdline in-file out-file)
       "")
      (when (member "file" result-params)
        (org-babel-result-cond result-params
          out-file
          (format "[[file:%s]]" out-file))))))

;; Add structure template for Typst blocks
(after! org-tempo
  (add-to-list 'org-structure-template-alist '("y" . "src typst :file output.pdf")))

** pdf-tools

#+begin_src elisp :tangle packages.el
(package! pdf-tools :built-in 'prefer)
#+end_src

** systemd units as conf-mode

#+begin_src elisp
(add-to-list 'auto-mode-alist '("\\.service\\'" . conf-space-mode))
#+end_src

* Coding
** ielm REPL

map ielm to ~SPC :~

#+begin_src elisp
(map! :leader ":" #'ielm)
#+end_src

** LSP

#+begin_src elisp
(use-package! lsp-treemacs
  :after lsp-mode  ;; and treemacs
  :config (lsp-treemacs-sync-mode 1))
#+end_src

*** Key Mappings

#+begin_src elisp
(map! (:after lsp-mode
       :map lsp-mode-map
       :leader
       :prefix ("c" . "+code")
       :desc "Diagnostic for Workspace" "X" #'lsp-treemacs-errors-list))
#+end_src

*** Options

[[https://emacs-lsp.github.io/lsp-mode/page/settings/mode/#lsp-inlay-hint-enable][lsp-mode settings]]

Enable hinlay hints and make the font a little smaller than the rest

#+begin_src elisp
(after! lsp-mode
  (setq! lsp-inlay-hint-enable t
         lsp-headerline-breadcrumb-enable t)
  ;; (add-to-list 'lsp-file-watch-ignored-directories "[/\\\\]\\.aider*\\'")
  )
#+end_src

*** emacs-lsp-booster

#+begin_src elisp
(when (< emacs-major-version 30)
  (after! lsp-mode
    (when (executable-find "emacs-lsp-booster")
      (defun lsp-booster--advice-json-parse (old-fn &rest args)
        "Try to parse bytecode instead of json."
        (or
         (when (equal (following-char) ?#)
           (let ((bytecode (read (current-buffer))))
             (when (byte-code-function-p bytecode)
               (funcall bytecode))))
         (apply old-fn args)))
      (advice-add (if (progn (require 'json)
                             (fboundp 'json-parse-buffer))
                      'json-parse-buffer
                    'json-read)
                  :around
                  #'lsp-booster--advice-json-parse)

      (defun lsp-booster--advice-final-command (old-fn cmd &optional test?)
        "Prepend emacs-lsp-booster command to lsp CMD."
        (let ((orig-result (funcall old-fn cmd test?)))
          (if (and (not test?)                             ;; for check lsp-server-present?
                   (not (file-remote-p default-directory)) ;; see lsp-resolve-final-command, it would add extra shell wrapper
                   lsp-use-plists
                   (not (functionp 'json-rpc-connection))  ;; native json-rpc
                   (executable-find "emacs-lsp-booster"))
              (progn
                (message "Using emacs-lsp-booster for %s!" orig-result)
                (cons "emacs-lsp-booster" orig-result))
            orig-result)))
      (advice-add 'lsp-resolve-final-command :around #'lsp-booster--advice-final-command)))
  )
#+end_src

** Code Formatting



mapping doom's ~+format/buffer~ and ~+format/region~

#+begin_src elisp
(map! (:when (modulep! :editor format)
       :v "g Q" '+format/region
       :v "SPC =" '+format/region
       :leader
       :desc "Format Buffer" "=" #'+format/buffer
       (:prefix ("b" "+buffer")
        :desc "Format Buffer" "f" #'+format/buffer)))
#+end_src

** PHP
:PROPERTIES:
:ID:       1a38710f-565e-4680-bc53-b39f3d955b71
:END:

#+BEGIN_SRC elisp
(after! (lsp-mode php-mode)
  (setq lsp-intelephense-licence-key (get-auth-info "intelephense" "ste.lendl@gmail.com")
        lsp-intelephense-files-associations '["*.php" "*.phtml" "*.inc"]
        lsp-intelephense-files-exclude '["**update.php**" "**/js/**" "**/fonts/**" "**/gui/**" "**/upload/**"
                                         "**/.git/**" "**/.svn/**" "**/.hg/**" "**/CVS/**" "**/.DS_Store/**"
                                         "**/node_modules/**" "**/bower_components/**"
                                         "**/vendor/**/{Test,test,Tests,tests}/**"]
        lsp-auto-guess-root nil
        lsp-idle-delay 0.8))
#+END_SRC

** Python
:PROPERTIES:
:ID:       294592b7-60fa-4fd5-ab2a-1d2eeadbd623
:END:

*** poetry

Poetry needs to scan for a project whenever a new file is opened. Tracking via
projectile speeds this up significantly.

#+begin_src elisp
(after! poetry (setq poetry-tracking-strategy 'projectile))
#+end_src

*** conda

automatically activate a conda environment if present in a project

#+begin_src elisp
(after! conda (conda-env-autoactivate-mode))
#+end_src

projectile does not recognize conda projects

#+begin_src elisp
(after! projectile
  (projectile-register-project-type 'python-conda '("environment.yml")
                                    :project-file "environment.yml"
                                    :compile "conda build"  ;; does not exist
                                    :test "conda run pytest"
                                    :test-dir "tests"
                                    :test-prefix "test_"
                                    :test-suffix"_test"))
#+end_src

*** numpydoc.el

#+begin_src elisp :tangle packages.el
;; (package! numpydoc)
#+end_src

#+begin_src elisp
;; (use-package! numpydoc
;;   :after python-mode
;;   :commands numpydoc-generate
;;   :config
;;   (map! :map python-mode-map
;;         :localleader
;;         :prefix ("d" . "docstring")
;;         :desc "Generate Docstring" "d" #'numpydoc-generate))
#+end_src

*** emacs ipython notebook (ein)

ein displays images in a separate window by default. Use inline images instead

#+begin_src elisp
(after! ein
  (setq! ein:output-area-inlined-images t
         ein:worksheet-warn-obsolesced-keybinding nil))
#+end_src

To enable this in the notebook, configure matplotlib to produce inline images.

#+begin_src python :tangle nil
%matplotlib inline
#+end_src

don't kill the *ein: buffer with ~ESC~ which causes the buffer not to work properly

org babel integration for ein

#+begin_src elisp
(when (modulep! :tools ein)
  (after! org
    (require 'ob-ein)))
#+end_src

*** emacs-jupyter

header arguments to for jupyter-python to work with plotly

#+begin_src elisp
(after! org
  (setq org-babel-default-header-args:jupyter-python
        '((:results . "value")
          (:session . "jupyter")
          (:kernel . "python3")
          (:pandoc . "t")
          (:exports . "both")
          (:cache . "no")
          (:noweb . "no")
          (:hlines . "no")
          (:tangle . "no")
          (:eval . "never-export"))))
#+end_src

*** Debug Test at point workaround

debugging python tests at point do not work with the default configuration.
might be merged upstream: https://github.com/emacs-lsp/dap-mode/pull/590

#+begin_src elisp
(after! (python-mode dap-mode)
  (dap-register-debug-template "Python :: Run pytest (at point) -- Workaround"
                             (list :type "python-test-at-point  "
                                   :args ""
                                   :program nil
                                   :module "pytest"
                                   :request "launch"
                                   :name "Python :: Run pytest (at point)")))
#+end_src

** Rust

#+begin_src elisp
(map!
 :mode rustic-mode
 :map rustic-mode-map
 :localleader
 :desc "rerun test" "t r" #'rustic-cargo-test-rerun
 )
#+end_src

#+begin_src elisp
(after! rustic
  (when (executable-find "cargo-nextest")
    (setq! rustic-cargo-test-runner 'nextest)))
#+end_src

Configure inlay type hints

This requires ~lsp-inlay-hint-enable~ as configured in [[* Inlay Hints][LSP/Inlay Hints]]

#+begin_src elisp
(after! lsp-rust
  (setq! lsp-rust-analyzer-binding-mode-hints t
  ;;        lsp-rust-analyzer-display-chaining-hints t
  ;;        lsp-rust-analyzer-display-closure-return-type-hints t
         lsp-rust-analyzer-display-lifetime-elision-hints-enable "skip_trivial"
  ;;        lsp-rust-analyzer-display-parameter-hints t
  ;;        lsp-rust-analyzer-hide-named-constructor t
         lsp-rust-analyzer-max-inlay-hint-length 40  ;; otherwise some types can get way out of hand
         )
  )
#+end_src

configre dap-mode for rust

#+begin_src elisp
(after! (rust-mode dap-mode)
  (dap-register-debug-template "Rust::GDB Run Configuration"
                               (list :type "gdb"
                                     :request "launch"
                                     :name "GDB::Run"
                                     :gdbpath "rust-gdb"
                                     :target nil
                                     :cwd nil)))
#+end_src

** Nix

set alejandra as the formatter

#+begin_src elisp
(after! nix-mode
  (set-formatter! 'alejandra '("alejandra" "--quiet") :modes '(nix-mode)))
#+end_src

Disable formatting with lsp

#+begin_src elisp
(setq-hook! 'nix-mode-hook +format-with-lsp nil)
#+end_src

** MQL
:PROPERTIES:
:ID:       c3da477e-b64b-4a50-af87-5fdec1fd62ab
:END:

#+BEGIN_SRC elisp
(add-to-list 'auto-mode-alist '("\\.mq[45h]\\'" . cpp-mode))
#+END_SRC

** Gitlab-CI
:PROPERTIES:
:ID:       2e1016eb-5a16-464e-a8bb-2a458f26db3d
:END:

#+BEGIN_SRC elisp
;; (use-package! gitlab-ci-mode
;;   :mode ".gitlab-ci.yml"
;;   )

;; (use-package! gitlab-ci-mode-flycheck
;;   :after flycheck gitlab-ci-mode
;;   :init
;;   (gitlab-ci-mode-flycheck-enable))
#+END_SRC

** Kubernetes
:PROPERTIES:
:ID:       fd4fae8c-3a70-449f-b3d5-52c25f76ec0a
:END:


#+begin_src elisp :tangle packages.el
(package! kubernetes :disable t)
(package! kubernetes-evil :disable t)
(package! kubernetes-helm :disable t)
(package! k8s-mode :disable t)
#+end_src

#+begin_src elisp
(use-package! kubernetes
  :commands (kubernetes-overview))
#+end_src

#+begin_src elisp
(use-package! kubernetes-evil
  :after kubernetes)
#+end_src

#+begin_src elisp
(use-package! kubernetes-helm
  :commands kubernetes-helm-status)
#+end_src

#+begin_src elisp
(use-package! k8s-mode
  :after yaml-mode
  :hook (k8s-mode . yas-minor-mode))
#+end_src

** SQL
:PROPERTIES:
:ID:       4efebc11-28ba-4f18-a758-a4af693d6f69
:END:

#+begin_src elisp :tangle packages.el
(package! sql-indent)
#+end_src

#+begin_src elisp
(use-package! sql-indent
  :after sql-mode
)
#+end_src

