config.org
** Database Interface (edbi)
:PROPERTIES:
:ID:       e54ac6a8-7cf4-47ea-abe6-500512022534
:END:

[[roam:edbi setup]]

EDBI has some dependencies has some dependencies
[[https://github.com/kiwanami/emacs-edbi#installation][Installation Instructions]]

#+begin_src elisp :tangle packages.el
(package! edbi :disable t)
(package! edbi-minor-mode :disable t)
#+end_src

#+begin_src elisp
(use-package! edbi
  :commands 'edbi:open-db-viewer
  )
#+end_src

#+begin_src elisp

(use-package! edbi-minor-mode
  :after sql-mode
  :hook sql-mode-hook
  )
;; (add-hook 'sql-mode-hook 'edbi-minor-mode)
#+end_src

** Practice coding with Exercism

[[https://exercism.org][Exercism]] is a platform for learning various programing languages by solving
small exercises. The exercises can can be solved locally.

[[https://exercism.org/docs/using/solving-exercises/working-locally][Local Setup Instructions]]

#+begin_src elisp :tangle packages.el
(package! exercism-mode :recipe (:host github :repo "timotheosh/exercism-mode") :disable t)
#+end_src

#+begin_src elisp
(use-package! exercism-mode
  :after projectile
  :if (executable-find "exercism")
  :commands exercism
  :config (exercism-mode +1)
  :custom (exercism-web-browser-function 'browse-url))
#+end_src

** Javascript | Typescript
*** Jest Testing Framework

#+begin_src elisp :tangle packages.el
(package! jest)
#+end_src

#+begin_src elisp
(map! :after rjsx-mode
      :map rjsx-mode-map
      :localleader
      :prefix ("t" "test")
      "f" #'jest-file
      "t" #'jest-function
      "k" #'jest-file-dwim
      "m" #'jest-repeat
      "p" #'jest-popup)
#+end_src

** Perl

always use the better cperl-mode instead of perl-mode.
This will be the default in Emacs 30 (if I remember correctly)

#+begin_src elisp
(add-to-list 'major-mode-remap-alist '(perl-mode . cperl-mode))
#+end_src

** Logview

#+begin_src elisp :tangle packages.el
(package! logview :disable t)
#+end_src

#+begin_src elisp
(use-package! logview
  :commands logview-mode
  :config (setq truncate-lines t)
  (map! :map logview-mode-map
        "j" #'logview-next-entry
        "k" #'logview-previous-entry))
#+end_src

The default keymap binds directly to ~f t T a A ...~
switch to evil-emacs-mode ~C-z~ to use the keybindings.

** Spell- Grammer Checking
*** LTEX

#+begin_src elisp :tangle packages.el
(package! lsp-ltex
  :disable t
  )
#+end_src

manually add adoc-mode to the list.. I don't like that...

#+begin_src elisp
;; (add-to-list 'lsp-ltex-active-modes 'adoc-mode t)
(setq lsp-ltex-active-modes '(text-mode bibtex-mode context-mode latex-mode markdown-mode org-mode rst-mode adoc-mode))
#+end_src

#+begin_src elisp
(use-package! lsp-ltex
  :after ;; (lsp-mode adoc-mode)
        lsp-ltex-active-modes
  :hook (adoc-mode . (lambda ()
                       (require 'lsp-ltex)
                       (lsp-deferred)))  ; or lsp-deferred
  :init
  (setq lsp-ltex-server-store-path "~/.nix-profile/bin/ltex-ls"
        lsp-ltex-version "16.0.0"
        lsp-ltex-mother-tongue "de-AT"
        lsp-ltex-user-rules-path (doom-path doom-private-dir "lsp-ltex")))
#+end_src

** Proxmox development
:PROPERTIES:
:header-args:elisp: :tangle no
:END:

_tangle is disabled for the entire section_ and is only kept as a reference!

*** AsciiDoc (adoc)

#+begin_src elisp :tangle packages.el
;; bbatsov/adoc-mode
(package! adoc-mode)
#+end_src

~TODO~ adoc-mode requires org due to inhereting the theme

#+begin_src elisp
(use-package! adoc-mode
  :defer t
  :config
  (map! :map adoc-mode-map
        :localleader
        :desc "consult headers in this file" "." #'consult-imenu
        :desc "consult headers in project" "/" #'consult-imenu-multi
        "p" #'treemacs-find-tag))
#+end_src

#+begin_src elisp
(after! lsp-mode
  (add-to-list 'lsp-language-id-configuration '(adoc-mode . "org") t))
#+end_src

*** Magit Default Sign-Off commits

#+begin_src elisp
(after! magit
  (setq transient-values  '((magit-commit "--signoff"))))
#+end_src

*** Javascript indentation style

This is still broken...

#+begin_src elisp
(setq-hook! 'rjsx-mode-hook
  indent-tabs-mode t
  tab-width 8)

(setq-hook! 'js-mode-hook
  indent-tabs-mode t
  tab-width 8)

(setq-hook! 'js2-mode-hook
  indent-tabs-mode t
  tab-width 8)
#+end_src

#+begin_src elisp
(after! js
  (setq js-indent-level 4
        js-jsx-indent-level 4
        tab-width 8))
#+end_src

*** Perl intendation style

#+begin_src elisp
(setq! cperl-indent-level 4
       cperl-close-paren-offset -4
       cperl-continued-statement-offset 4
       cperl-indent-parens-as-block t)
#+end_src

Proxmox specific Perl indentation style using a tab where 8 spaces would be used.

#+begin_src elisp
(setq-hook! 'cperl-mode-hook
  tab-width 8
  indent-tabs-mode t)
#+end_src

*** notmuch

#+begin_src elisp
(after! notmuch
  (setq +notmuch-sync-backend 'mbsync
        +notmuch-mail-folder "~/Mail"
        notmuch-draft-folder "proxmox/Entw&APw-rfe"
        notmuch-fcc-dirs "proxmox/Sent"
        notmuch-mua-cite-function 'message-cite-original-without-signature
        notmuch-mua-compose-in 'current-window
        notmuch-show-logo nil
        notmuch-hello-indent 0  ;; do not indent because it works better with evil navigation
        notmuch-tag-formats '(("unread" (propertize tag 'face 'notmuch-tag-unread)))
        notmuch-saved-searches
        '((:key "i" :name "󰇮 inbox"   :query "tag:inbox and not tag:archive")
          (:key "f" :name " flagged" :query "tag:flagged")
          (:key "m" :name "󰇮 my PRs"  :query "tag:my-pr and not tag:archive and not tag:killed and not tag:deleted and not tag:inbox")
          (:key "w" :name "󰇮 watch"   :query "tag:watch and not tag:my-pr and not tag:archive and not tag:killed and not tag:deleted and not tag:inbox")
          (:key "t" :name "󰇮 team"    :query "tag:lists/team and not tag:archive and not tag:inbox")
          (:key "b" :name " My Bugs" :query "tag:bugs and tag:to-me and not tag:archive and not tag:inbox")
          (:key "s" :name " support (new)" :query "tag:support-new and not tag:archive and not tag:killed")
          (:key "r" :name " review"  :query "tag:review and not tag:archive and not tag:killed and not tag:inbox")
          (:key "d" :name " drafts"  :query "tag:draft and not tag:archive and not tag:deleted")
          ;; (:key ">" :name "󰗕 sent"    :query "tag:sent and not tag:archive")
          (:key "M" :name " my PRs" :query "tag:my-pr and not tag:killed and not tag:deleted and not tag:inbox")
          (:key "W" :name " watch" :query "tag:watch and not tag:killed and not tag:deleted and not tag:inbox")
          (:key "B" :name " Bugzilla" :query "tag:bugs and not tag:archive and not tag:inbox")
          (:key "S" :name " support" :query "tag:support and not tag:archive and not tag:killed and not tag:inbox")
          (:key "P" :name " pkgs"    :query "tag:lists/pkgs and not tag:archive and not tag:inbox"))
        notmuch-archive-tags '("+archive" "-inbox" "-unread")
        +notmuch-spam-tags '("+spam" "-inbox" "-unread")
        +notmuch-delete-tags '("+trash" "-inbox" "-unread")

        stfl/notmuch-unwatch-tags (append notmuch-archive-tags '("-my-pr" "-watch" "-review"))
        stfl/notmuch-kill-tags (cons "+killed" stfl/notmuch-unwatch-tags)

        message-hidden-headers nil  ;; don't hide any headers to verify In-reply-to and Reference headers
        notmuch-mua-hidden-headers nil

        message-sendmail-f-is-evil 't
        message-sendmail-extra-arguments '("--read-envelope-from")
        message-send-mail-function 'message-send-mail-with-sendmail
        sendmail-program "msmtp")
  (add-to-list '+word-wrap-disabled-modes 'notmuch-show-mode)
  (add-hook! 'notmuch-hello-mode-hook #'read-only-mode)
  (defun +notmuch-get-sync-command ()
    "mbsync -a && notmuch new && afew -n -t"))
#+end_src

Additional functions to apply tags according to my workflow

#+begin_src elisp
(after! notmuch
  (defun stfl/notmuch-search-unwatch-thread (&optional unarchive beg end)
    (interactive (cons current-prefix-arg (notmuch-interactive-region)))
    (let ((notmuch-archive-tags stfl/notmuch-unwatch-tags))
      (notmuch-search-archive-thread unarchive beg end)))

  (defun stfl/notmuch-search-kill-thread (&optional unarchive beg end)
    (interactive (cons current-prefix-arg (notmuch-interactive-region)))
    (let ((notmuch-archive-tags stfl/notmuch-kill-tags))
      (notmuch-search-archive-thread unarchive beg end)))
  )
#+end_src

Use the (almost) default keybindings in evil normal-mode

#+begin_src elisp
(map! :after notmuch
      :map notmuch-common-keymap
      :n "?" #'notmuch-help
      :map notmuch-show-mode-map
      ;; :g "<mouse-1>" #'notmuch-show-toggle-message
      ;; :g "<mouse-2>" #'notmuch-show-toggle-message
      ;; :desc "toggle show message" :n "<tab>" #'notmuch-show-toggle-message
      ;; :desc "toggle show message" :n "C-<tab>" #'notmuch-show-open-or-close-all
      :g "C-c C-e" #'notmuch-show-resume-message
      :n "ge" #'notmuch-show-resume-message
      ;; :n "A" '(λ! (notmuch-search-tag-all "-archive -my-pr -watch"))  ;; TODO need to tag ENTIRE thread oterhwise it will be tagged again with afew
      :map notmuch-tree-mode-map
      :g "C-c C-e" #'notmuch-tree-resume-message
      :n "ge" #'notmuch-tree-resume-message
      :n "A" (λ! (notmuch-tree-tag-thread stfl/notmuch-unwatch-tags))
      :n "K" (λ! (notmuch-tree-tag-thread stfl/notmuch-kill-tags))
      :map notmuch-search-mode-map
      :n "A" #'stfl/notmuch-search-unwatch-thread
      :n "K" #'stfl/notmuch-search-kill-thread
      ;; :map notmuch-message-mode-map
      ;; :n "SPC f s" #'notmuch-draft-save
      )
#+end_src

#+begin_src elisp
(after! notmuch
  (defun stfl/notmuch-hello-update-background ()
    "Update notmuch-hello buffer. If we are in another frame, allow switch to it so it will be formatted correctly."
    (let ((no-display (eq (selected-frame)
                          (window-frame (display-buffer "*notmuch-hello*")))))
      (notmuch-hello no-display)))

  (run-with-idle-timer 60 t #'stfl/notmuch-hello-update-background))
#+end_src

** ssh-config-mode

#+begin_src elisp :tangle packages.el
(package! ssh-config-mode
  ;; :recipe (:host github
           ;; :repo "jhgorrell/ssh-config-mode-el"
           ;; :files ("*.el" "out"))
  )
#+end_src

#+begin_src elisp
(use-package! ssh-config-mode :defer t)
#+end_src

** BitBake

#+begin_src elisp :tangle packages.el
;; (package! bitbake-modes
;;   :recipe (:host bitbucket
;;            :repo "olanilsson/bitbake-modes"
;;            ;; :files ("*.el")
;;            ))
#+end_src

#+begin_src elisp
;; (use-package! bitbake-modes
;;   :config (add-to-list 'auto-mode-alist '("\\.inc$" . bitbake-mode))
;;   :defer t)
#+end_src

#+begin_src elisp :tangle packages.el
;; (package! bb-mode
;;   :recipe (:host github
;;            :repo "mferland/bb-mode"
;;            :files ("*.el")))
#+end_src

#+begin_src elisp
;; (use-package bb-modes
;;   :init
;;   (add-to-list 'auto-mode-alist '("\\.bb" . bb-mode))
;;   (add-to-list 'auto-mode-alist '("\\.bbappend" . bb-mode))
;;   (add-to-list 'auto-mode-alist '("\\.bbclass" . bb-mode))
;;   (add-to-list 'auto-mode-alist '("\\conf/.conf" . bb-mode))
;;   (add-to-list 'auto-mode-alist '("\\.inc$" . bb-mode))
;;   :config
;;   (bitbake-lsp-register))
#+end_src

#+begin_src elisp
;; (defun bitbake-lsp-register ()
;;   "Register to start using this language server."
;;   (interactive)
;;   (add-to-list 'lsp-language-id-configuration '(bb-mode . "bitbake"))
;;     (lsp-register-client
;;      (make-lsp-client :new-connection
;;                       (lsp-stdio-connection `(,(executable-find "bitbake-language-server")))
;;                       :activation-fn (lsp-activate-on "*.bb" "*.bbappend" "*.bbclass" "*.inc" "conf/*.conf")
;;                       :server-id 'bitbake)))
#+end_src

** Meson build system

#+begin_src elisp :tangle packages.el
(package! meson-mode :disable t)
#+end_src

#+begin_src elisp
(use-package! meson-mode
  :config (add-hook! 'meson-mode-hook #'company-mode))
#+end_src

** C/C++

#+begin_src elisp
(after! projectile
  (add-to-list 'projectile-globally-ignored-directories ".ccls-cache"))
#+end_src

#+begin_src elisp
(defun run-ctest (arg)
  (interactive "P")
  (let ((projectile-project-test-cmd "cmake --build build && ctest --test-dir build --output-on-failure --rerun-failed"))
    (projectile-test-project arg)))


(map! ;;:after cc-mode
      :mode c++-mode
      :map c++-mode-map
      :localleader 
      :prefix ("t" "test")
      :n "t" #'run-ctest
      ;; :n "t" #'gtest-run-at-point
      ;; :n "T" #'gtest-run
      ;; :n "l" #'gtest-list
      )

#+end_src

#+begin_src elisp
;; (after! lsp-mode
;;   (set-lsp-priority! 'ccls 2))
#+end_src

#+begin_src elisp :tangle packages.el
;; (package! gtest-mode
;;   :recipe (:host github
;;            :repo "ppatoria/elisp"
;;            :files ("gtest-mode/*.el")))
#+end_src

#+begin_src elisp
;; (use-package! gtest-mode
;;   ;; :after c++-mode
;;   :config
;;   (map! :map gtest-mode-map
;;         :localleader 
;;         :prefix ("t" "test")
;;         :n "t" #'gtest-run-at-point
;;         :n "T" #'gtest-run
;;         :n "l" #'gtest-list))
#+end_src

** Turbo Log

#+begin_src elisp :tangle packages.el
(package! turbo-log :recipe (:host github :repo "artawower/turbo-log"))
#+end_src

#+begin_src elisp
(use-package! turbo-log
  :after prog-mode
  :config
  (map! :leader
        "l l" #'turbo-log-print
        "l i" #'turbo-log-print-immediately
        "l h" #'turbo-log-comment-all-logs
        "l s" #'turbo-log-uncomment-all-logs
        "l [" #'turbo-log-paste-as-logger
        "l ]" #'turbo-log-paste-as-logger-immediately
        "l x" #'turbo-log-delete-all-logs)
  (setq turbo-log-msg-format-template "\"🚀: %s\""
        turbo-log-allow-insert-without-tree-sitter-p t))
#+end_src

** just

#+begin_src elisp :tangle packages.el
(package! just-mode)
#+end_src

#+begin_src elisp
(use-package just-mode)
#+end_src

#+begin_src elisp :tangle packages.el
(package! justl :recipe (:host github :repo "psibi/justl.el") :disable t)
#+end_src

#+begin_src elisp
(use-package justl
  :disabled
  )
  ;; :config
  ;; (map! :n "e" 'justl-exec-recipe))
#+end_src

* Collaboration and VCS
** Directory tree diff - ztree
:PROPERTIES:
:ID:       74eab92f-af80-47ab-b6ac-0712d7e87699
:END:

#+begin_src elisp :tangle packages.el
(package! ztree :disable t)
#+end_src

#+BEGIN_SRC elisp
(use-package! ztree)
#+END_SRC

** Magit
*** Enable Gravatars

This will enable gravatars when viewing commits. The service used by default is [[https://www.libravatar.org/][Libravatar]].
#+BEGIN_SRC elisp
;; (setq magit-revision-show-gravatars '("^Author:     " . "^Commit:     "))
#+END_SRC

*** Enable granular diff-highlights for all hunks

By default, changes are highlighted *line-wise* for all but the selected hunk. This
has [[https://magit.vc/manual/magit/Performance.html][performance reasons]]. You can enable character-wise highlights for all
visible hunks with:

#+BEGIN_SRC elisp
(after! magit
  (setq magit-diff-refine-hunk 'all))
#+END_SRC

