packages.el

(package! codeium
  :recipe (:host github
           :repo "Exafunction/codeium.el"))

(package! gptel)

(package! elysium)

(package! aider
  :recipe (:host github
           :repo "tninja/aider.el"
           :files ("*.el")))

(package! aidermacs)
